Repository: Dylanolivro/mastermind_csharp
Catalog: Resources/Strings.*.resx
Languages: fr

# WelcomeMessage
source: Welcome to MasterMind
fr: Bienvenue sur MasterMind

# ChooseColors
source: Choose the number of colors in the sequence (between 4 and 10):
fr: Choisissez le nombre de couleurs dans la séquence (entre 4 et 10) :

# ChooseAttempts
source: Choose the number of attempts (between 10 and 100):
fr: Choisissez le nombre de tentatives (entre 10 et 100) :

# InvalidInput
source: Error: Please enter a valid number between {0} and {1}.
fr: Erreur : Veuillez entrer un nombre valide entre {0} et {1}.

# EnterGuess
source: Enter your guess (separate colors with a comma):
fr: Entrez votre tentative (séparez les couleurs par une virgule) :

# InvalidGuess
source: Error: You must enter exactly {0} colors.
fr: Erreur : Vous devez entrer exactement {0} couleurs.

# InvalidColors
source: Error: The following colors are invalid: {0}
fr: Erreur : Les couleurs suivantes sont invalides : {0}

# ValidColors
source: Valid colors: {0}
fr: Couleurs valides : {0}

# Attempt
source: Attempt {0}/{1}
fr: Tentative {0}/{1}

# Feedback
source: Well placed: {0}, Misplaced: {1}
fr: Bien placée : {0}, Mal placée : {1}

# WinMessage
source: Congratulations! You found the sequence!
fr: Félicitations ! Vous avez trouvé la séquence !

# LoseMessage
source: Sorry, you lost. The sequence was:
fr: Dommage, vous avez perdu. La séquence était :

# VisualFeedback
source: Visual clues:
fr: Indices visuels :

# ColorBlack
source: Black
fr: Noir

# ColorBlue
source: Blue
fr: Bleu

# ColorBrown
source: Brown
fr: Marron

# ColorGreen
source: Green
fr: Vert

# ColorPink
source: Pink
fr: Rose

# ColorPurple
source: Purple
fr: Violet

# ColorRed
source: Red
fr: Rouge

# ColorWhite
source: White
fr: Blanc

# ColorYellow
source: Yellow
fr: Jaune
